## Pandas

### 1. Pandas DataFrame and Operations

In [6]:
# pandas 라이브러리를 불러옵니다. pd를 약칭으로 사용합니다.
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

- DataFrame은 2차원 테이블이고, 테이블의 한 줄(행/열)을 Series라고 합니다.


- Series의 모임이 곧, DataFrame이 됩니다.

In [7]:
# s는 1, 3, 5, 6, 8을 원소로 가지는 pandas.Series
s = pd.Series([1,3,5,6,8])

In [8]:
# 12x4 행렬에 1부터 48까지의 숫자를 원소를 가지고,
# index는 2023-08-01부터 시작하고,
# coulmns은 순서대로 X1, X2, X3, X4로 하는 DataFrame 생성
data = np.arange(1,49).reshape(12, -1)
df = pd.DataFrame(
    data=np.arange(1,49).reshape(12, -1),
    index=pd.date_range(start='2023-08-01',end='2023-08-12', freq='D'),
    columns=['X1', 'X2', 'X3', 'X4'])
df

            X1  X2  X3  X4
2023-08-01   1   2   3   4
2023-08-02   5   6   7   8
2023-08-03   9  10  11  12
2023-08-04  13  14  15  16
2023-08-05  17  18  19  20
2023-08-06  21  22  23  24
2023-08-07  25  26  27  28
2023-08-08  29  30  31  32
2023-08-09  33  34  35  36
2023-08-10  37  38  39  40
2023-08-11  41  42  43  44
2023-08-12  45  46  47  48

In [9]:
# dataframe index
df.index

DatetimeIndex(['2023-08-01', '2023-08-02', '2023-08-03', '2023-08-04',
               '2023-08-05', '2023-08-06', '2023-08-07', '2023-08-08',
               '2023-08-09', '2023-08-10', '2023-08-11', '2023-08-12'],
              dtype='datetime64[ns]', freq='D')

In [10]:
# dataframe columns
df.columns

Index(['X1', 'X2', 'X3', 'X4'], dtype='object')

In [11]:
# dataframe values
type(df.values)

numpy.ndarray

In [12]:
# 특정 column을 가져오기
df['X1']

2023-08-01     1
2023-08-02     5
2023-08-03     9
2023-08-04    13
2023-08-05    17
2023-08-06    21
2023-08-07    25
2023-08-08    29
2023-08-09    33
2023-08-10    37
2023-08-11    41
2023-08-12    45
Freq: D, Name: X1, dtype: int32

In [13]:
# X1 column에 2 더하기
df['X1'] + 2

2023-08-01     3
2023-08-02     7
2023-08-03    11
2023-08-04    15
2023-08-05    19
2023-08-06    23
2023-08-07    27
2023-08-08    31
2023-08-09    35
2023-08-10    39
2023-08-11    43
2023-08-12    47
Freq: D, Name: X1, dtype: int32

### 2.2. Dataframe 기초 method

In [14]:
# dataframe의 맨 위 다섯줄을 보여주는 head()
df.head(5)

            X1  X2  X3  X4
2023-08-01   1   2   3   4
2023-08-02   5   6   7   8
2023-08-03   9  10  11  12
2023-08-04  13  14  15  16
2023-08-05  17  18  19  20

In [15]:
# 10줄
df.head(10)

            X1  X2  X3  X4
2023-08-01   1   2   3   4
2023-08-02   5   6   7   8
2023-08-03   9  10  11  12
2023-08-04  13  14  15  16
2023-08-05  17  18  19  20
2023-08-06  21  22  23  24
2023-08-07  25  26  27  28
2023-08-08  29  30  31  32
2023-08-09  33  34  35  36
2023-08-10  37  38  39  40

In [16]:
# dataframe에 대한 전체적인 요약정보를 보여줍니다.
# index, columns, null/not-null/dtype/memory usage가 표시됩니다.
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 12 entries, 2023-08-01 to 2023-08-12
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      12 non-null     int32
 1   X2      12 non-null     int32
 2   X3      12 non-null     int32
 3   X4      12 non-null     int32
dtypes: int32(4)
memory usage: 288.0 bytes

In [17]:
# dataframe에 대한 전체적인 통계정보를 보여줍니다.
df.describe()

              X1         X2         X3         X4
count  12.000000  12.000000  12.000000  12.000000
mean   23.000000  24.000000  25.000000  26.000000
std    14.422205  14.422205  14.422205  14.422205
min     1.000000   2.000000   3.000000   4.000000
25%    12.000000  13.000000  14.000000  15.000000
50%    23.000000  24.000000  25.000000  26.000000
75%    34.000000  35.000000  36.000000  37.000000
max    45.000000  46.000000  47.000000  48.000000

In [18]:
# X2 column를 기준으로 내림차순 정렬
df.sort_values(by='X2', ascending=False)

            X1  X2  X3  X4
2023-08-12  45  46  47  48
2023-08-11  41  42  43  44
2023-08-10  37  38  39  40
2023-08-09  33  34  35  36
2023-08-08  29  30  31  32
2023-08-07  25  26  27  28
2023-08-06  21  22  23  24
2023-08-05  17  18  19  20
2023-08-04  13  14  15  16
2023-08-03   9  10  11  12
2023-08-02   5   6   7   8
2023-08-01   1   2   3   4

### 2.3. Fancy Indexing !

- 데이터를 filtering <=> Search !

- 전체 데이터에서 원하는 일부의 데이터를 찾아오는 방법 !

In [19]:
# pandas dataframe은 column 이름을 이용하여 기본적인 Indexing이 가능합니다.
# X1 column을 indexing
df['X1']

2023-08-01     1
2023-08-02     5
2023-08-03     9
2023-08-04    13
2023-08-05    17
2023-08-06    21
2023-08-07    25
2023-08-08    29
2023-08-09    33
2023-08-10    37
2023-08-11    41
2023-08-12    45
Freq: D, Name: X1, dtype: int32

In [20]:
# dataframe에서 slicing을 이용하면 row 단위로 잘려나옵니다.
# 앞에서 3줄을 slicing 합니다.
df[0:3]

            X1  X2  X3  X4
2023-08-01   1   2   3   4
2023-08-02   5   6   7   8
2023-08-03   9  10  11  12

In [21]:
# df.loc는 특정값을 기준으로 indexing합니다. (key - value)
df.loc['2023-08-01']

X1    1
X2    2
X3    3
X4    4
Name: 2023-08-01 00:00:00, dtype: int32

In [22]:
# df.loc에 2차원 indexing도 가능합니다.
df.loc['2023-08-03','X3']

11

In [23]:
df.loc[['2023-08-01', '2023-08-03'], ['X1', 'X4']]

            X1  X4
2023-08-01   1   4
2023-08-03   9  12

In [24]:
df.loc['2023-08-01':'2023-08-07', 'X2':'X3']

            X2  X3
2023-08-01   2   3
2023-08-02   6   7
2023-08-03  10  11
2023-08-04  14  15
2023-08-05  18  19
2023-08-06  22  23
2023-08-07  26  27

In [25]:
# dataframe에 조건식을 적용해주면 조건에 만족하는지 여부를 알려주는 "mask"가 생깁니다.
# Q. df에서 X3 column에 있는 원소들중에 3의 배수만 출력해주세요!
df.loc[df.X3 % 3 == 0, 'X1':'X3']

            X1  X2  X3
2023-08-01   1   2   3
2023-08-04  13  14  15
2023-08-07  25  26  27
2023-08-10  37  38  39

In [26]:
df.loc[df['X2'] > 20, 'X2']

2023-08-06    22
2023-08-07    26
2023-08-08    30
2023-08-09    34
2023-08-10    38
2023-08-11    42
2023-08-12    46
Freq: D, Name: X2, dtype: int32

In [27]:
# 2차원 리스트 indexing과 같은 원리가 되었습니다.
# integer-location based indexing
df.iloc[[0], [1]]

            X2
2023-08-01   2

In [28]:
# iloc로 2차원 indexing을 하게되면,
# row 기준으로 index 3,4를 가져오고
# column 기준으로 0, 1을 가져옵니다.
df.iloc[[3,4], [0,1]]

            X1  X2
2023-08-04  13  14
2023-08-05  17  18

In [45]:
# Q. 2차원 indexing에 뒤에가 : 면 어떤 의미일까요?
df.loc[['2023-08-01'], :]

            X1  X2  X3  X4
2023-08-01   1   2   3   4

## 2.3. 여러 DataFrame 합치기

In [30]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

df4 = pd.DataFrame({'A': ['A1', 'A2', 'A4', 'A5'], 
                    'E': ['E0', 'E1', 'E2', 'E3'],
                    'F': ['F0', 'F1', 'F2', 'F3']})

In [31]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [32]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [33]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [46]:
# 그냥 합치기 (concatenation)
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [48]:
pd.concat([df1, df4])

    A    B    C    D    E    F
0  A0   B0   C0   D0  NaN  NaN
1  A1   B1   C1   D1  NaN  NaN
2  A2   B2   C2   D2  NaN  NaN
3  A3   B3   C3   D3  NaN  NaN
0  A1  NaN  NaN  NaN   E0   F0
1  A2  NaN  NaN  NaN   E1   F1
2  A4  NaN  NaN  NaN   E2   F2
3  A5  NaN  NaN  NaN   E3   F3

In [50]:
pd.concat([df1, df4], axis=1)

    A   B   C   D   A   E   F
0  A0  B0  C0  D0  A1  E0  F0
1  A1  B1  C1  D1  A2  E1  F1
2  A2  B2  C2  D2  A4  E2  F2
3  A3  B3  C3  D3  A5  E3  F3

In [52]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [53]:
df4

    A   E   F
0  A1  E0  F0
1  A2  E1  F1
2  A4  E2  F2
3  A5  E3  F3

In [51]:
# SQL과 같이 join operation을 사용할 수 있다. (inner join)
pd.merge(df1, df4, on='A')

    A   B   C   D   E   F
0  A1  B1  C1  D1  E0  F0
1  A2  B2  C2  D2  E1  F1

In [54]:
# left join
pd.merge(df1, df4, on='A', how='left')

    A   B   C   D    E    F
0  A0  B0  C0  D0  NaN  NaN
1  A1  B1  C1  D1   E0   F0
2  A2  B2  C2  D2   E1   F1
3  A3  B3  C3  D3  NaN  NaN

## 2.4 DataFrame으로 데이터 불러오기


Source : https://www.kaggle.com/c/titanic/data

In [37]:
# train.csv 파일 불러오기
titanic = pd.read_csv('./data/train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [38]:
# Q1. 데이터에서 남녀 성비를 구해주세요. 577 : 314
# titanic['Sex'].value_counts()
print(f"male : female = {len(titanic.loc[titanic.Sex=='male'])}:{len(titanic.loc[titanic.Sex=='female'])}")

male : female = 577:314

In [39]:
# Q2. 데이터에서 여성 승객들의 평균 fare를 구해주세요.
titanic.loc[titanic.Sex=='female', 'Fare'].mean()

44.47981783439491

In [40]:
# Q3. 이름에 Mr.가 포함된 사람이 몇명인지 구해주세요.
len(titanic[titanic.Name.str.contains('Mr.', regex=False)])

517

In [41]:
len(titanic[titanic.Name.apply(lambda name: 'Mr.' in name)])

517

In [56]:
# 결측치를 하나라도 포함하고 있는 데이터가 몇개나 있는지 확인.
titanic.loc[titanic.isnull().any(axis=1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [61]:
titanic.isnull().sum(axis=0)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [67]:
titanic = titanic.drop(columns=["Cabin"]).dropna()
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

## 2.5. Pivot Table을 이용하여 데이터 살펴보기

- pivot table이란 기존 테이블 구조를 특정 column을 기준으로 재구조화한 테이블을 말합니다.

- 특정 column을 기준으로 pivot하기 때문에, 어떤 column에 어떤 연산을 하느냐에 따라서 만들어지는 결과가 바뀝니다.

- 주로 어떤 column을 기준으로 데이터를 해석하고 싶을 때 사용합니다.

In [63]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [68]:
# 성별을 기준으로 생존률 파악 --> Mean vs Sum
titanic.pivot_table(values='Survived', index='Sex', aggfunc='mean')

        Survived
Sex
female  0.752896
male    0.205298

In [71]:
titanic.pivot_table(values='Survived', index='Sex', aggfunc=['count','sum','mean'])

          count      sum      mean
       Survived Survived  Survived
Sex
female      259      195  0.752896
male        453       93  0.205298

In [75]:
# 사회 계급을 기준으로 생존률 파악
pd.pivot_table(
    data=titanic,
    values='Survived',
    index=['Pclass','Sex'],
    aggfunc=['count','sum','mean']
)

                 count      sum      mean
              Survived Survived  Survived
Pclass Sex
1      female       83       80  0.963855
       male        101       40  0.396040
2      female       74       68  0.918919
       male         99       15  0.151515
3      female      102       47  0.460784
       male        253       38  0.150198